In [1]:
import numpy as np
import pandas as pd
import pymysql

In [2]:
df=pd.read_csv("train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
#● Display the first few rows to understand the dataset. 
print(df.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [5]:
#A. Select the following columns only: 
selected_columns = [
    "PassengerId",
    "Survived",
    "Pclass",
    "Sex",
    "Age",
    "Fare",
    "Embarked"
]

df_selected = df[selected_columns]

print("Selected columns:")
print(df_selected.head())

Selected columns:
   PassengerId  Survived  Pclass     Sex   Age     Fare Embarked
0            1         0       3    male  22.0   7.2500        S
1            2         1       1  female  38.0  71.2833        C
2            3         1       3  female  26.0   7.9250        S
3            4         1       1  female  35.0  53.1000        S
4            5         0       3    male  35.0   8.0500        S

In [ ]:
#B. Handle Missing Values 
#Fill missing Age with the median 
#Fill missing Embarked with the most frequent value

In [17]:
# Fill missing Age with the median
df["Age"] = df["Age"].fillna(df["Age"].median())

# Fill missing Embarked with the most frequent value
df["Embarked"] = df["Embarked"].fillna(df["Embarked"].mode()[0])

In [18]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [20]:
#C. Encode Categorical Columns 
#Apply label encoding to: 
#● Gender 
#● Embarked 

from sklearn.preprocessing import LabelEncoder

# Create encoders
le_gender = LabelEncoder()
le_embarked = LabelEncoder()

# Apply label encoding
df["Sex"] = le_gender.fit_transform(df["Sex"])   
df["Embarked"] = le_embarked.fit_transform(df["Embarked"])

In [21]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,2
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,2

In [22]:
#D. Scale Numeric Columns 
#Use StandardScaler for: 
#● Age 
#● Fare

from sklearn.preprocessing import StandardScaler

# Create scaler
scaler = StandardScaler()

# Select numeric columns to scale
numeric_cols = ["Age", "Fare"]

# Fit + transform
df[numeric_cols] = scaler.fit_transform(df[numeric_cols])
#output:
print(df[["Age", "Fare"]].head())

        Age      Fare
0 -0.565736 -0.502445
1  0.663861  0.786845
2 -0.258337 -0.488854
3  0.433312  0.420730
4  0.433312 -0.486337

In [23]:
#E. Produce a final cleaned DataFrame

In [25]:
#Scaled numeric columns:
df_selected = df[["PassengerId", "Survived", "Pclass", "Sex", "Age", "Fare", "Embarked"]]

In [26]:
# Numeric columns to scale
numeric_features = ["Age", "Fare"]

In [27]:
# Categorical columns to encode
categorical_features = ["Sex", "Embarked"]

In [28]:
# Columns to keep unchanged
remaining_features = ["PassengerId", "Survived", "Pclass"]

In [29]:
# Numeric pipeline: impute missing values with median + scale
numeric_pipeline = Pipeline(steps=[
    ("imputer", SimpleImputer(strategy="median")),     # Fill Age/Fare missing values with median
    ("scaler", StandardScaler())                       # Apply StandardScaler to numeric columns
])

In [30]:
# Categorical pipeline: impute missing values with most frequent + one-hot encode
categorical_pipeline = Pipeline(steps=[
    ("imputer", SimpleImputer(strategy="most_frequent")),  # Fill Embarked missing values with most frequent
    ("onehot", OneHotEncoder(handle_unknown="ignore"))     # Apply One-Hot Encoding to categorical columns
])

NameError: name 'OneHotEncoder' is not defined